# Etape 1
* Importez les bibliothèques nécessaires

In [1]:
import pandas as pd

# Etape 2
* Importez l'ensemble de données à partir du fichier « etudiant.csv »

In [2]:
data_student=pd.read_csv("data/student.csv")

# Etape 3
* Attribuez-les à une variable appelée df (dataframe).

In [3]:
df=pd.DataFrame(data_student)

# Etape 4
* Pour les besoins de cet exercice, découpez les données de la colone «école» à la colonne «gardien».

<p style="font-size:28px ;text-align:center;color:blue"> Quelques infos sur nos donnees</p>

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 34 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  395 non-null    int64
 1   school      395 non-null    object
 2   sex         395 non-null    object
 3   age         395 non-null    int64
 4   address     395 non-null    object
 5   famsize     395 non-null    object
 6   Pstatus     395 non-null    object
 7   Medu        395 non-null    int64
 8   Fedu        395 non-null    int64
 9   Mjob        395 non-null    object
 10  Fjob        395 non-null    object
 11  reason      395 non-null    object
 12  guardian    395 non-null    object
 13  traveltime  395 non-null    int64
 14  studytime   395 non-null    int64
 15  failures    395 non-null    int64
 16  schoolsup   395 non-null    object
 17  famsup      395 non-null    object
 18  paid        395 non-null    object
 19  activities  395 non-null    object
 20  nursery     395 non-null    object
 21  higher      395 non-null    object
 22  internet    395 non-null    object
 23  romantic    395 non-null    object
 24  famrel      395 non-null    int64
 25  freetime    395 non-null    int64
 26  goout       395 non-null    int64
 27  Dalc        395 non-null    int64
 28  Walc        395 non-null    int64
 29  health      395 non-null    int64
 30  absences    395 non-null    int64
 31  G1          395 non-null    int64
 32  G2          395 non-null    int64
 33  G3          395 non-null    int64
dtypes: int64(17), object(17)
memory usage: 105.1+ KB

In [5]:
df=df.iloc[:,1:13]

In [6]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father

<p style="font-size:28px ;text-align:center;color:red"> </p>

# Etape 5
* Créez une fonction lambda qui mettra les chaînes de caractères en majuscule.

In [7]:
maj= lambda string: string.upper()

# Etape 6 
* Mettre en majuscule les variables Mjob et Fjob

<p style="font-size:18px ;text-align:center;color:red"> on va jouer le jeux, etape 8 oblige  </p>

In [8]:
df.loc[:,"Mjob"].apply(maj)
df.loc[:,"Fjob"].apply(maj)

0       TEACHER
1         OTHER
2         OTHER
3      SERVICES
4         OTHER
         ...
390    SERVICES
391    SERVICES
392       OTHER
393       OTHER
394     AT_HOME
Name: Fjob, Length: 395, dtype: object

# Etape 7
* Affichez les derniers éléments de l'ensemble de données

In [9]:
df.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

# Etape 8
* Avez-vous remarqué que les données d'origine sont toujours en minuscules? Pourquoi donc? Corrigez-le et mettez en majuscule Mjob et Fjob.

<p style="font-size:18px ;color:green">Oui nous avons remarque.<br> </br>
    help(df.apply) permet de comprendre que la methode apply renvoi un objet independant de df.
la methode "apply " travail avec une copy parfaite qu'elle applique element par element au lambda "maj" puis renvoi le resultat</p>

In [10]:
df.loc[:,"Mjob"]=df.loc[:,"Mjob"].apply(maj)
df.loc[:,"Fjob"]=df.loc[:,"Fjob"].apply(maj)
df.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,SERVICES,SERVICES,course,other
391,MS,M,17,U,LE3,T,3,1,SERVICES,SERVICES,course,mother
392,MS,M,21,R,GT3,T,1,1,OTHER,OTHER,course,other
393,MS,M,18,R,LE3,T,3,2,SERVICES,OTHER,course,mother
394,MS,M,19,U,LE3,T,1,1,OTHER,AT_HOME,course,father

# Etape 9
* Créez une fonction appelée est_majeur qui renvoie une valeur booléenne dans une nouvelle colonne appelée legal_drinker (considérez comme majeurs les plus de 17ans )

In [13]:
def est_majeur (data_frame,data_age="age"):
    # faire des try /exception pour s'assurer de la conformite des arguments ne ferra qu'allourdir le code
    # on fait un minimum confiance a l'user
    """
    est_majeur(DataFrame : 'data_frame',colum age:'data_age'="age")
    
    renvoie une valeur booléenne dans une nouvelle colonne appelée legal_drinker .
    par defaut la colonne des ages serra "age"
    Ne modifie pas 'data_frame'
    """
    data_frame=data_frame #Je demande a python de cree une variable data_frame local a ma fonction 
                          # et de lui affecter la valeur de data_frame (qu'il va chercher puis trouver ! ) 
                           # j'ai pas de methode pour copier proprement mon data frame donc j'improvise
    data_frame.loc[:, 'legal_drinker'] = data_frame.loc[:, data_age] > 17 # je met un point d'honeur a utiliser .loc
    return data_frame

In [14]:
est_majeur(df).loc[:,["age","legal_drinker"]]

     age  legal_drinker
0     18           True
1     17          False
2     15          False
3     15          False
4     16          False
..   ...            ...
390   20           True
391   17          False
392   21           True
393   18           True
394   19           True

[395 rows x 2 columns]

# Fin partie A de Pandas